In [4]:
url = 'https://beta.adalab.es/curso-intensivo-fullstack-recursos/apis/alumnos-v1/alumnos.json'

In [1]:
import pandas as pd

import requests

import re

In [5]:
def llamar_api(url):

    llamada = requests.get(url)

    print(f"La llamada a la API nos ha dado una respuesta de tipo: {llamada.status_code}")

    if llamada.status_code != 200:  # Comprueba si la respuesta no fue exitosa (código de estado distinto de 200).
        print(f"El motivo por el que la llamada falló es {llamada.reason}")  # Imprime la razón de la falla.
    else:
        return llamada.json()

In [8]:
results = llamar_api(url)

La llamada a la API nos ha dado una respuesta de tipo: 200

In [10]:
type(results)

dict

In [11]:
len(results)

2

In [15]:
print(results.keys())

dict_keys(['info', 'results'])

In [19]:
alumnos = results.values()

In [23]:
results_alumons = results['results']

In [24]:
df = pd.DataFrame(results_alumons)

In [25]:
df

    num_expediente   nombre  apellidos fecha_nacimiento
0             1001      Ana   Martínez       2005-03-15
1             1002     Luis  Fernández       2004-11-22
2             1003    Clara       Ruiz       2006-01-10
3             1004    Pedro    Sánchez       2005-07-08
4             1005    Lucía     Torres       2004-09-18
5             1006   Javier   González       2006-06-24
6             1007    María      López       2005-04-10
7             1008    David      Pérez       2004-12-12
8             1009     Sara     García       2005-08-15
9             1010  Ricardo     Martín       2006-03-22
10            1011     Alba    Vázquez       2004-05-05
11            1012   Carlos    Serrano       2005-02-28
12            1013    Elena    Ramírez       2006-08-01
13            1014     Iván  Hernández       2005-10-30
14            1015    Laura    Jiménez       2004-07-14
15            1016    Tomás      López       2005-12-18
16            1017    Paula  Fernández       2006-02-06
17            1018    Mario       Díaz       2004-11-30
18            1019   Raquel   González       2005-09-23
19            1020    Jorge    Álvarez       2006-05-17

In [26]:
import mysql.connector
from mysql.connector import errorcode

In [27]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database = 'instituto2')

In [31]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.37-cp313-cp313-win_amd64.whl.metadata (9.9 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.1.1-cp313-cp313-win_amd64.whl.metadata (3.9 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\kathe\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (4.12.2)
Downloading SQLAlchemy-2.0.37-cp313-cp313-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 25.8 MB/s eta 0:00:00
Downloading greenlet-3.1.1-cp313-cp313-win_amd64.whl (299 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.1.1 sqlalchemy-2.0.37
Note: you may need to restart the kernel to use updated packages.

In [ ]:
from sqlalchemy import create_engine

In [39]:
username = 'root'  # MySQL username (string)
password = 'AlumnaAdalab'  # MySQL password (string)
database = 'instituto2'  # Database name (string)

engine = create_engine(f'mysql+mysqlconnector://{username}:{password}@localhost/{database}')


# Drop rows with index 0 to 4 (i.e., rows 1 to 5)
df_cleaned = df.drop(index=[0, 1, 2, 3, 4])

# Now you can proceed with inserting the cleaned DataFrame into the database or any other operation.
df_cleaned.to_sql(name='alumnos', con=engine, if_exists='append', index=False)

15

In [42]:
mycursor = cnx.cursor()
mycursor.execute("SELECT * FROM alumnos")
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('1001', 'Ana Martínez', 'Martínez', datetime.date(2005, 3, 15))
('1002', 'Luis Fernández', 'Fernández', datetime.date(2004, 11, 22))
('1003', 'Clara Ruiz', 'Ruiz', datetime.date(2006, 1, 10))
('1004', 'Pedro Sánchez', 'Sánchez', datetime.date(2005, 7, 8))
('1005', 'Lucía Torres', 'Torres', datetime.date(2004, 9, 18))
('1006', 'Javier', 'González', datetime.date(2006, 6, 24))
('1007', 'María', 'López', datetime.date(2005, 4, 10))
('1008', 'David', 'Pérez', datetime.date(2004, 12, 12))
('1009', 'Sara', 'García', datetime.date(2005, 8, 15))
('1010', 'Ricardo', 'Martín', datetime.date(2006, 3, 22))
('1011', 'Alba', 'Vázquez', datetime.date(2004, 5, 5))
('1012', 'Carlos', 'Serrano', datetime.date(2005, 2, 28))
('1013', 'Elena', 'Ramírez', datetime.date(2006, 8, 1))
('1014', 'Iván', 'Hernández', datetime.date(2005, 10, 30))
('1015', 'Laura', 'Jiménez', datetime.date(2004, 7, 14))
('1016', 'Tomás', 'López', datetime.date(2005, 12, 18))
('1017', 'Paula', 'Fernández', datetime.date(2006, 2, 6))
('1018', 'Mario', 'Díaz', datetime.date(2004, 11, 30))
('1019', 'Raquel', 'González', datetime.date(2005, 9, 23))
('1020', 'Jorge', 'Álvarez', datetime.date(2006, 5, 17))

In [ ]:
mycursor = cnx.cursor()
query = "INSERT INTO alumnas (name, apellido, ciudad, telefono) VALUES (%s, %s, %s, %s)"
val = [
("Elena", "Jones", "Paris", "20376789"),
("Joy", "Garcia", "Paris", "20376657"),
("Madison", "Rodriguez", "Paris", "567893203"),
("Libby", "Harris", "Paris", "675204729"),
("Cindy", "Taylor", "Paris", "879376240"),
("Erica", "Swift", "Paris", "656483202"),
("Emily", "Rogers", "Paris", "789043254"),
("Lenssa", "Trump", "Paris", "6783208432")
]
mycursor.executemany(query, val)
cnx.commit()